resources/lab4/channel_optimization/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    boundaries
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       750;
    }
    planes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       830;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1630;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       1640;
    }
)

// ************************************************************************* //
